# Prototype database functions

You can do it in Colab!

## Install dependencies

In [ ]:
!pip install sqlalchemy psycopg2-binary

## Provide your database URL

Run the code cell below, and enter your database URL into the prompt, in this format:

`dialect://user:password@host/dbname`

If you don't have a Postgres database yet, you can use:

`sqlite:///`

ðŸš¨ Then clear the cell's output above, so people who view your notebook don't see your database credentials ðŸš¨

## Connect to your database

Just run this code cell as-is.

In [165]:
import sqlalchemy

engine = sqlalchemy.create_engine(database_url)
connection = engine.connect()

In [ ]:
database_url = input()

## Prototype your functions

Use the connection within your function, like the examples below.

Then add your function to your FastAPI app in `app/db.py` like this:

```
@router.get('/myendpoint')  # or @router.post
async def my_function(my_parameter, connection=Depends(get_db)):
```

### Example 1

In [166]:
def get_url():
    """Verify we can connect to the database, 
    and return the database URL in this format:

    dialect://user:password@host/dbname
    
    The password will be hidden with ***
    """
    url_without_password = repr(connection.engine.url)
    return {'database_url': url_without_password}

In [167]:
get_url()

{'database_url': 'postgresql://postgres:***@cityspire-ds-c.c2uishzxxikl.us-east-1.rds.amazonaws.com/postgres'}

In [10]:
import pandas as pd
df =pd.read_csv('https://raw.githubusercontent.com/Lambda-School-Labs/cityspire-c-ds/main/app/data/pop_rent_crime_walk_cost_livability_bins.csv',index_col=0)
print(df.shape)
df.head()

(68, 36)

,Location,2019 Population,Town or City,2019 Rental Rates,State,City,Violent crime,Murder and nonnegligent manslaughter,Rape,Robbery,...,Walk Score Categories,Walk Score Ranges,Bike Score Categories,Bike Score Ranges,Cost of Living Index,Cost of Living Index Categories,Cost of Living Index Ranges,Livability Score,Livability Score Categories,Livability Score Ranges
0,"Phoenix, Arizona",1680992,city,1447,Arizona,Phoenix,11803,131,1139,3197,...,Higher Walk Score,38.0-48.0,Highest Bike Scores,52.0-96.0,105.8,Highest Cost of Living Index,103.74-183.0,8401.33,Average Livability Scores,"6,756.68-8,531.98"
1,"Tucson, Arizona",548073,city,1248,Arizona,Tucson,3775,40,527,1105,...,Higher Walk Score,38.0-48.0,Highest Bike Scores,52.0-96.0,99.7,Higher Cost of Living Index,96.18-103.74,8531.99,Higher Livability Scores,"8,531.98-10,735.50"
2,"Little Rock, Arkansas",197312,city,895,Arkansas,Little Rock,3009,38,209,391,...,Average Walk Score,31.0-38.0,Lowest Bike Scores,6.999-34.0,89.4,Lower Cost of Living Index,88.5-91.4,1044.57,Lowest Livability Scores,"217.99-5,161.60"
3,"Bakersfield, California",384145,city,1340,California,Bakersfield,1766,34,116,701,...,Average Walk Score,31.0-38.0,Average Bike Scores,41.0-46.0,103.6,Higher Cost of Living Index,96.18-103.74,7045.51,Average Livability Scores,"6,756.68-8,531.98"
4,"Riverside, California",331360,city,1944,California,Riverside,1686,17,139,476,...,Higher Walk Score,38.0-48.0,Higher Bike Scores,46.0-52.0,116.8,Highest Cost of Living Index,103.74-183.0,9532.98,Higher Livability Scores,"8,531.98-10,735.50"

In [ ]:
def write_data(df):
    tablename = 'cityspire01'
    df.to_sql(tablename, connection, if_exists='append', index=False, method='multi')

In [ ]:
write_data(df)

In [16]:
def read_data():
    query = """SELECT * FROM cityspire01 LIMIT 5"""
    df_1= pd.read_sql(query, connection)
    return df_1.to_dict(orient='records')

In [17]:
read_data()

[{'city': 'Lewisville, TX',
  'state': 'TX',
  'index': '2014-01-01',
  'Studio': 707.0,
  '1br': 843.0,
  '2br': 1048.0,
  '3br': 1420.0,
  '4br': 1809.0},
 {'city': 'Lewisville, TX',
  'state': 'TX',
  'index': '2014-02-01',
  'Studio': 707.0,
  '1br': 842.0,
  '2br': 1046.0,
  '3br': 1419.0,
  '4br': 1807.0},
 {'city': 'Lewisville, TX',
  'state': 'TX',
  'index': '2014-03-01',
  'Studio': 709.0,
  '1br': 845.0,
  '2br': 1050.0,
  '3br': 1423.0,
  '4br': 1813.0},
 {'city': 'Lewisville, TX',
  'state': 'TX',
  'index': '2014-04-01',
  'Studio': 714.0,
  '1br': 851.0,
  '2br': 1057.0,
  '3br': 1433.0,
  '4br': 1825.0},
 {'city': 'Lewisville, TX',
  'state': 'TX',
  'index': '2014-05-01',
  'Studio': 719.0,
  '1br': 857.0,
  '2br': 1065.0,
  '3br': 1444.0,
  '4br': 1839.0}]

### Census Table

In [168]:
def write_data(df):
    tablename = 'census'
    df.to_sql(tablename, connection, if_exists='replace', index=False, method='multi')

In [173]:
import pandas as pd
df = pd.read_csv("census_finaldata.csv")
print(df.shape)
df.head()

(29991, 3)

         city state  POPESTIMATE2019
0   Abbeville    AL             2560
1  Adamsville    AL             4281
2     Addison    AL              718
3       Akron    AL              328
4   Alabaster    AL            33487

In [174]:
write_data(df)

In [175]:
def read_data():
    query = """SELECT * FROM census LIMIT 5"""
    df_1= pd.read_sql(query, connection)
    return df_1.to_dict(orient='records')

In [176]:
read_data()

[{'city': 'Abbeville', 'state': 'AL', 'POPESTIMATE2019': 2560},
 {'city': 'Adamsville', 'state': 'AL', 'POPESTIMATE2019': 4281},
 {'city': 'Addison', 'state': 'AL', 'POPESTIMATE2019': 718},
 {'city': 'Akron', 'state': 'AL', 'POPESTIMATE2019': 328},
 {'city': 'Alabaster', 'state': 'AL', 'POPESTIMATE2019': 33487}]

### Rental_table

In [186]:
def write_data(df):
    tablename = 'rental'
    df.to_sql(tablename, connection, if_exists='replace', index=False, method='multi')

In [187]:
import pandas as pd
df = pd.read_csv("rental_clean.csv", index_col=0)
print(df.shape)
df.head()

(429, 83)

,city,State,Bedroom_Size,Price_2014_01,Price_2014_02,Price_2014_03,Price_2014_04,Price_2014_05,Price_2014_06,Price_2014_07,...,Price_2019_11,Price_2019_12,Price_2020_01,Price_2020_02,Price_2020_03,Price_2020_04,Price_2020_05,Price_2020_06,Price_2020_07,Price_2020_08
0,New York,NY,Studio,1780,1778,1781,1786,1794,1802,1817,...,1940,1943,1939,1938,1939,1934,1923,1904,1886,1864
5,Los Angeles,CA,Studio,957,961,964,969,972,975,981,...,1150,1150,1151,1151,1151,1149,1146,1142,1140,1138
10,Chicago,IL,Studio,853,855,859,864,869,874,879,...,940,942,941,943,945,946,946,944,942,939
15,Houston,TX,Studio,683,688,692,696,700,706,711,...,743,744,745,747,748,746,742,739,738,737
20,Philadelphia,PA,Studio,738,742,745,748,751,753,757,...,821,823,823,823,825,824,824,824,824,824

In [188]:
df.columns

Index(['city', 'State', 'Bedroom_Size', 'Price_2014_01', 'Price_2014_02',
       'Price_2014_03', 'Price_2014_04', 'Price_2014_05', 'Price_2014_06',
       'Price_2014_07', 'Price_2014_08', 'Price_2014_09', 'Price_2014_10',
       'Price_2014_11', 'Price_2014_12', 'Price_2015_01', 'Price_2015_02',
       'Price_2015_03', 'Price_2015_04', 'Price_2015_05', 'Price_2015_06',
       'Price_2015_07', 'Price_2015_08', 'Price_2015_09', 'Price_2015_10',
       'Price_2015_11', 'Price_2015_12', 'Price_2016_01', 'Price_2016_02',
       'Price_2016_03', 'Price_2016_04', 'Price_2016_05', 'Price_2016_06',
       'Price_2016_07', 'Price_2016_08', 'Price_2016_09', 'Price_2016_10',
       'Price_2016_11', 'Price_2016_12', 'Price_2017_01', 'Price_2017_02',
       'Price_2017_03', 'Price_2017_04', 'Price_2017_05', 'Price_2017_06',
       'Price_2017_07', 'Price_2017_08', 'Price_2017_09', 'Price_2017_10',
       'Price_2017_11', 'Price_2017_12', 'Price_2018_01', 'Price_2018_02',
       'Price_2018_03', 'Price_2018_04', 'Price_2018_05', 'Price_2018_06',
       'Price_2018_07', 'Price_2018_08', 'Price_2018_09', 'Price_2018_10',
       'Price_2018_11', 'Price_2018_12', 'Price_2019_01', 'Price_2019_02',
       'Price_2019_03', 'Price_2019_04', 'Price_2019_05', 'Price_2019_06',
       'Price_2019_07', 'Price_2019_08', 'Price_2019_09', 'Price_2019_10',
       'Price_2019_11', 'Price_2019_12', 'Price_2020_01', 'Price_2020_02',
       'Price_2020_03', 'Price_2020_04', 'Price_2020_05', 'Price_2020_06',
       'Price_2020_07', 'Price_2020_08'],
      dtype='object')

In [189]:
df = df[['city','State','Bedroom_Size','Price_2020_08']]
df.head()

            city State Bedroom_Size  Price_2020_08
0       New York    NY       Studio           1864
5    Los Angeles    CA       Studio           1138
10       Chicago    IL       Studio            939
15       Houston    TX       Studio            737
20  Philadelphia    PA       Studio            824

In [190]:
write_data(df)

In [191]:
def read_data():
    query = """SELECT * FROM rental LIMIT 10"""
    df_1= pd.read_sql(query, connection)
    return df_1.to_dict(orient='records')

In [192]:
read_data()

[{'city': 'New York',
  'State': 'NY',
  'Bedroom_Size': 'Studio',
  'Price_2020_08': 1864},
 {'city': 'Los Angeles',
  'State': 'CA',
  'Bedroom_Size': 'Studio',
  'Price_2020_08': 1138},
 {'city': 'Chicago',
  'State': 'IL',
  'Bedroom_Size': 'Studio',
  'Price_2020_08': 939},
 {'city': 'Houston',
  'State': 'TX',
  'Bedroom_Size': 'Studio',
  'Price_2020_08': 737},
 {'city': 'Philadelphia',
  'State': 'PA',
  'Bedroom_Size': 'Studio',
  'Price_2020_08': 824},
 {'city': 'Phoenix',
  'State': 'AZ',
  'Bedroom_Size': 'Studio',
  'Price_2020_08': 731},
 {'city': 'San Antonio',
  'State': 'TX',
  'Bedroom_Size': 'Studio',
  'Price_2020_08': 697},
 {'city': 'San Diego',
  'State': 'CA',
  'Bedroom_Size': 'Studio',
  'Price_2020_08': 1421},
 {'city': 'Dallas',
  'State': 'TX',
  'Bedroom_Size': 'Studio',
  'Price_2020_08': 763},
 {'city': 'San Jose',
  'State': 'CA',
  'Bedroom_Size': 'Studio',
  'Price_2020_08': 1771}]

### Crime Table

In [150]:
def write_data(df):
    tablename = 'crime'
    df.to_sql(tablename, connection, if_exists='replace', index=False, method='multi')

In [151]:
import pandas as pd
df = pd.read_csv("crime_clean.csv", index_col=0)
print(df.shape)
df.head()

(5031, 22)

,city,vcr_2018,pcr_2018,vcr_2017,pcr_2017,vcr_2016,pcr_2016,vcr_2015,pcr_2015,vcr_2014,...,pcr_2013,vcr_2012,pcr_2012,vcr_2011,pcr_2011,vcr_2010,pcr_2010,vcr_2009,pcr_2009,State
0,Abbeville,0.007056,0.019208,0.004633,0.025483,0.004218,0.019555,0.003448,0.029119,0.003027,...,0.023819,0.008103,0.020994,0.004813,0.024065,0.007119,0.022712,0.003070,0.018076,AL
1,Adamsville,0.004395,0.066852,0.005768,0.060222,0.004341,0.057117,0.005664,0.074762,0.006772,...,0.071636,0.006163,0.064275,0.008143,0.066021,0.002085,0.061301,0.005315,0.072704,AL
2,Alabaster,0.002746,0.017283,0.002225,0.015848,0.002936,0.014770,0.004148,0.016781,0.001837,...,0.020533,0.001585,0.022087,0.001935,0.021510,0.001072,0.016731,0.001367,0.021165,AL
4,Alexander City,0.021584,0.041930,0.017295,0.037371,0.018850,0.044709,0.014878,0.043894,0.005441,...,0.044990,0.006360,0.046063,0.009233,0.051382,0.003874,0.042419,0.008767,0.055987,AL
9,Ashford,0.001865,0.014918,0.003254,0.006974,0.001388,0.014808,0.002304,0.029032,0.002311,...,0.024805,0.000919,0.031250,0.004171,0.037998,0.001398,0.041007,0.002396,0.022520,AL

In [152]:
df = df[['city','State','vcr_2018','pcr_2018']]
print(df.shape)
df.head()

(5031, 4)

             city State  vcr_2018  pcr_2018
0       Abbeville    AL  0.007056  0.019208
1      Adamsville    AL  0.004395  0.066852
2       Alabaster    AL  0.002746  0.017283
4  Alexander City    AL  0.021584  0.041930
9         Ashford    AL  0.001865  0.014918

In [153]:
df.rename(columns={"vcr_2018": "Violent_crime2018", 'pcr_2018': 'Property_crime2018'},inplace=True)
df.head()

             city State  Violent_crime2018  Property_crime2018
0       Abbeville    AL           0.007056            0.019208
1      Adamsville    AL           0.004395            0.066852
2       Alabaster    AL           0.002746            0.017283
4  Alexander City    AL           0.021584            0.041930
9         Ashford    AL           0.001865            0.014918

In [154]:
print(df.shape)
df.columns

(5031, 4)

Index(['city', 'State', 'Violent_crime2018', 'Property_crime2018'], dtype='object')

In [155]:
write_data(df)

In [156]:
def read_data():
    query = """SELECT * FROM crime LIMIT 5"""
    df_1= pd.read_sql(query, connection)
    return df_1.to_dict(orient='records')

In [157]:
read_data()

[{'city': 'Abbeville',
  'State': 'AL',
  'Violent_crime2018': 0.007056056448451587,
  'Property_crime2018': 0.019208153665229318},
 {'city': 'Adamsville',
  'State': 'AL',
  'Violent_crime2018': 0.0043950959981494345,
  'Property_crime2018': 0.06685172334027296},
 {'city': 'Alabaster',
  'State': 'AL',
  'Violent_crime2018': 0.002746186680994597,
  'Property_crime2018': 0.01728306617712904},
 {'city': 'Alexander City',
  'State': 'AL',
  'Violent_crime2018': 0.021583722848501512,
  'Property_crime2018': 0.041930162221611215},
 {'city': 'Ashford',
  'State': 'AL',
  'Violent_crime2018': 0.0018648018648018648,
  'Property_crime2018': 0.014918414918414918}]

### Walkscore_table

In [115]:
def write_data(df):
    tablename = 'walk_score'
    df.to_sql(tablename, connection, if_exists='replace', index=False, method='multi')

In [116]:
import pandas as pd
df = pd.read_csv("walkscore_clean.csv", index_col=0)
print(df.shape)
df.head()

(2500, 5)

          City  Walk Score  Bike Score  Population State
0  Birmingham           35          31      212237    AL
1   Montgomery          26          38      205764    AL
2       Mobile          32          39      195111    AL
3   Huntsville          24          40      180105    AL
4   Tuscaloosa          33          37       90468    AL

In [117]:
df.rename(columns={"City": "city"},inplace=True)
df.columns

Index(['city', 'Walk Score', 'Bike Score', 'Population', 'State'], dtype='object')

In [118]:
df = df[['city','State', 'Walk Score', "Bike Score"]]
print(df.shape)
df.head()

(2500, 4)

          city State  Walk Score  Bike Score
0  Birmingham     AL          35          31
1   Montgomery    AL          26          38
2       Mobile    AL          32          39
3   Huntsville    AL          24          40
4   Tuscaloosa    AL          33          37

In [119]:
df.columns

Index(['city', 'State', 'Walk Score', 'Bike Score'], dtype='object')

In [120]:
write_data(df)

In [121]:
def read_data():
    query = """SELECT * FROM walk_score  LIMIT 10"""
    df_1= pd.read_sql(query, connection)
    return df_1.to_dict(orient='records')

In [122]:
read_data()

[{'city': 'Birmingham ', 'State': 'AL', 'Walk Score': 35, 'Bike Score': 31},
 {'city': 'Montgomery', 'State': 'AL', 'Walk Score': 26, 'Bike Score': 38},
 {'city': 'Mobile', 'State': 'AL', 'Walk Score': 32, 'Bike Score': 39},
 {'city': 'Huntsville', 'State': 'AL', 'Walk Score': 24, 'Bike Score': 40},
 {'city': 'Tuscaloosa', 'State': 'AL', 'Walk Score': 33, 'Bike Score': 37},
 {'city': 'Hoover', 'State': 'AL', 'Walk Score': 17, 'Bike Score': 12},
 {'city': 'Dothan', 'State': 'AL', 'Walk Score': 23, 'Bike Score': 35},
 {'city': 'Decatur', 'State': 'AL', 'Walk Score': 25, 'Bike Score': 40},
 {'city': 'Auburn', 'State': 'AL', 'Walk Score': 27, 'Bike Score': 38},
 {'city': 'Madison', 'State': 'AL', 'Walk Score': 17, 'Bike Score': 34}]

In [60]:
import psycopg2
from psycopg2.extras import execute_values
DATABASE_URL='postgresql://postgres:teamcdatabase@cityspire-ds-c.c2uishzxxikl.us-east-1.rds.amazonaws.com/postgres'
connection = psycopg2.connect(DATABASE_URL)
psqlCursor= connection.cursor()

In [55]:
import psycopg2
from psycopg2.extras import execute_values
DATABASE_URL='postgresql://postgres:teamcdatabase@cityspire-ds-c.c2uishzxxikl.us-east-1.rds.amazonaws.com/postgres'
connection = psycopg2.connect(DATABASE_URL)

from psycopg2.extensions import ISOLATION_LEVEL_AUTOCOMMIT
psqlCursor= connection.cursor()
#Name of the table to be deleted
tableName = "cityspire"
# Form the SQL statement - DROP TABLE
dropTableStmt   = "DROP TABLE %s"%tableName
# Execute the drop table command
psqlCursor.execute(dropTableStmt)
psqlCursor.close()
connection.close()

In [62]:
import psycopg2
from psycopg2.extras import execute_values
DATABASE_URL='postgresql://postgres:teamcdatabase@cityspire-ds-c.c2uishzxxikl.us-east-1.rds.amazonaws.com/postgres'
connection = psycopg2.connect(DATABASE_URL)

from psycopg2.extensions import ISOLATION_LEVEL_AUTOCOMMIT
psqlCursor= connection.cursor()
#Name of the table to be deleted
tableName = "Cityspire"
# Form the SQL statement - DROP TABLE
dropTableStmt   = "DROP TABLE %s"%tableName
# Execute the drop table command
psqlCursor.execute(dropTableStmt)
psqlCursor.close()
connection.close()

In [63]:
import psycopg2
from psycopg2.extras import execute_values
DATABASE_URL='postgresql://postgres:teamcdatabase@cityspire-ds-c.c2uishzxxikl.us-east-1.rds.amazonaws.com/postgres'
connection = psycopg2.connect(DATABASE_URL)

from psycopg2.extensions import ISOLATION_LEVEL_AUTOCOMMIT
psqlCursor= connection.cursor()
#Name of the table to be deleted
tableName = "walkscore"
# Form the SQL statement - DROP TABLE
dropTableStmt   = "DROP TABLE %s"%tableName
# Execute the drop table command
psqlCursor.execute(dropTableStmt)
psqlCursor.close()
connection.close()